<a href="https://colab.research.google.com/github/james-caldwell1981/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-06-04 13:48:09--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.141.14
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.141.14|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  70.0MB/s    in 2.8s

2020-06-04 13:48:11 (70.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd

#create each dataframe
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [6]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [7]:
orders = orders.drop(labels=['order_dow', 'order_hour_of_day', 
                             'days_since_prior_order', 'eval_set', 'order_number'], axis=1)
orders.head()

   order_id  user_id
0   2539329        1
1   2398795        1
2    473747        1
3   2254736        1
4    431534        1

In [8]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [9]:
products = products.drop(['aisle_id', 'department_id'],axis=1)

products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [10]:
order_products__prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
order_products__prior = order_products__prior.drop(['add_to_cart_order',
                                                    'reordered'], axis=1)
order_products__prior.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [12]:
order_products__train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [13]:
order_products__train = order_products__train.drop(['add_to_cart_order',
                                                    'reordered'], axis=1)
order_products__train.head()

   order_id  product_id
0         1       49302
1         1       11109
2         1       10246
3         1       49683
4         1       43633

In [14]:
order_products = pd.concat([order_products__prior, order_products__train])
order_products.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [15]:
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [36]:
'''
Separating the top ten products is where I was tripped up.
I forgot how to use a boolean mask which Ryan explained as
a condition. At the time of his explanation I understood.
While looking at the boolean values, I was confused while
working on the assignment. Now I understand and should be
fine.
The code below uses the list of top ten most ordered products
to check against the full list of products and extract only
the corresponding product id for each of the top ten items.
'''

top_ten_list = pd.DataFrame(['Banana', 'Bag of Organic Bananas', 'Strawberries',
                'Organic Baby Spinach', 'Organic Hass Avocado',
                'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes',
                'Organic Whole Milk'])

condition = products['product_name'].isin(top_ten_list[0])
products_subset = products[condition]

products_subset.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [37]:
order_products.head(15)

    order_id  product_id
0          2       33120
1          2       28985
2          2        9327
3          2       45918
4          2       30035
5          2       17794
6          2       40141
7          2        1819
8          2       43668
9          3       33754
10         3       24838
11         3       17704
12         3       21903
13         3       17668
14         3       46667

In [38]:
condition = order_products['product_id'].isin(products_subset['product_id'])

top_ten_orders = order_products[condition]

top_ten_orders.head(15)

     order_id  product_id
12          3       21903
30          5       13176
51          5       47209
77         10       24852
80         10       47766
126        14       27845
170        18       47766
180        20       24852
190        22       24852
206        23       47766
234        26       24852
238        26       21903
240        26       47766
241        27       13176
247        27       47766

In [39]:
'''
This held me up overnight. I walked away for a while.
My syntax was solid. Dataframes set up properly. My code didn't
work and I had no idea why. I went to sleep. This morning, after
another hour, I figured out I needed to use .transpose() and not
.pivot_table.
'''

tallied = top_ten_orders['product_id'].value_counts()
tallied.head(15)

24852    491291
13176    394930
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [40]:
'''
After getting .transpose() to work fine, I still had a key error check
for duplicates message. There were none. Syntax still correct. I forgot
to save the transposed frame and was just displaying it, which is now
corrected.
'''

tallied = pd.DataFrame([tallied.index, tallied], ['product_id', 'times_ordered']).transpose()

tallied.head(10)

   product_id  times_ordered
0       24852         491291
1       13176         394930
2       21903         251705
3       47209         220877
4       47766         184224
5       47626         160792
6       16797         149445
7       26209         146660
8       27845         142813

In [41]:
products_subset.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [42]:
tallied.head()

   product_id  times_ordered
0       24852         491291
1       13176         394930
2       21903         251705
3       47209         220877
4       47766         184224

In [45]:
'''
Once the dataframe was saved properly in the tallied variable,
my code now displays the fully merged frames as one. If there
is a silver lining to all of this time used, it would be that
I feel better at troubleshooting dataframes.

At the same time, I need to seek assistance and read more on
.pivot_table and .melt so I understand more how they work
because I thought I needed one of those instead of .transpose.
Hopefully it will click in the rest of the assignment.
'''

final = pd.merge(products_subset, tallied, on='product_id')

final.head(10)

   product_id            product_name  times_ordered
0       13176  Bag of Organic Bananas         394930
1       16797            Strawberries         149445
2       21903    Organic Baby Spinach         251705
3       24852                  Banana         491291
4       26209                   Limes         146660
5       27845      Organic Whole Milk         142813
6       47209    Organic Hass Avocado         220877
7       47626             Large Lemon         160792
8       47766         Organic Avocado         184224

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [64]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

print(table1)
table2

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
'''
This is what I missed during class, apparently.
above, everything I tried the first time would
have worked perfectly in the first section had
I just reset the indexes. Then I could have 
used melt() instead of transpose().
'''

table1 = table1.reset_index()

In [66]:
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [0]:
#wide=>tidy

tidy  = table1.melt(id_vars='index', value_vars=(['treatmenta', 'treatmentb']))

In [68]:
table1.head()

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [69]:
tidy1 = tidy.rename(columns={'index'   : 'name',
                              'variable': 'trt',
                              'value'   : 'result'
                              })
tidy1

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [70]:
tidy1.trt = tidy1.trt.str.replace('treatment', '')

tidy1

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [71]:
#tidy=>wide

wide = tidy1.pivot_table(index='name', columns='trt', values='result')

wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [72]:
# tidy -> table2

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [74]:
tidy2 = table2.reset_index()

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [79]:
tidy2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [82]:
#tidy  = table1.melt(id_vars='index', value_vars=(['treatmenta', 'treatmentb']))
tidy2 = tidy2.melt(id_vars='index', value_vars=(['John Smith', 'Jane Doe', 'Mary Johnson']))

tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
flights = sns.load_dataset('flights')

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####